Pandas - DataFrame and Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning.
It provides two primary DS: Series and DataFrame
A Series is a 1D array-like object
A DataFrame is a 2D, size-mutable and potentially heterogeneous tabular DS with labeled axes(rows and columns)

In [ ]:
import pandas as pd

In [ ]:
# Series(single column)
# A pandas Series is a 1D array-like object that can hold any data type.
# It is similar to a column in a table
import pandas as pd

data = [1, 2, 3, 4, 5]
series = pd.Series(data)

print("Series:\n", series) 
print(type(series))

Series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
# create a Series from dictionary (key index bn jta hai)
data = {'a':1, 'b':2, 'c':3}
seriesD = pd.Series(data)

print(seriesD)

a    1
b    2
c    3
dtype: int64

In [5]:
data = [10, 20, 30]
index = ['a', 'b', 'c']

pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [7]:
# DataFrame (multiple column)
# create a DataFrame from a dictionary of list

data = {
    "Name":["Modi", "Rahul", "Arvind"],
    "Age":[65, 45, 55],
    "City":["Varanasi", "Wayanad", "Delhi"]
}

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      City
0    Modi   65  Varanasi
1   Rahul   45   Wayanad
2  Arvind   55     Delhi
<class 'pandas.core.frame.DataFrame'>

In [9]:
# create a DataFrame from list of dictionary
data = [
    {"Name":"Modi", "Age":65, "City":"Varanasi"},
    {"Name":"Rahul", "Age":45, "City":"Wayanad"},
    {"Name":"Arvind", "Age":55, "City":"Delhi"}
]

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      City
0    Modi   65  Varanasi
1   Rahul   45   Wayanad
2  Arvind   55     Delhi
<class 'pandas.core.frame.DataFrame'>

In [10]:
# Data Manipulation with DataFrame
df

     Name  Age      City
0    Modi   65  Varanasi
1   Rahul   45   Wayanad
2  Arvind   55     Delhi

In [14]:
# Adding a column
df["Salary"] = [50000, 60000, 70000]
df

     Name  Age      City  Salary
0    Modi   65  Varanasi   50000
1   Rahul   45   Wayanad   60000
2  Arvind   55     Delhi   70000

In [ ]:
# Remove a column
# to permanently remove use, inplace = True
df.drop("Salary", axis = 1, inplace = True)

In [25]:
df

     Name  Age      City
0    Modi   69  Varanasi
1   Rahul   49   Wayanad
2  Arvind   59     Delhi

In [26]:
# add age to the column
df["Age"] = df["Age"]+1
df

     Name  Age      City
0    Modi   70  Varanasi
1   Rahul   50   Wayanad
2  Arvind   60     Delhi

In [29]:
df.drop(0, inplace=True)